1. 'number' + 3 + 3
// 'number' + 3 даЇ р€док 'number3'.
// 'number3' + 3 даЇ р€док 'number33'.
// –езультат: 'number33'

2. null + 3
// Null дор≥внюЇ 0.
// 0 + 3 дор≥внюЇ 3.
// –езультат: 3

3. 5 && "qwertyФ 
// && - це лог≥чне ≤ або AND.
// ƒва значенн€ €вл€ютьс€ true.
// ќператор && бачить, що перше значенн€ ≥стинне, ≥ повертаЇ друге значенн€.
// –езультат: "qwertyФ

4. +'40' + +'2' + "hillel";
// ѕлюс перед значенн€м примусово перетворюЇ значенн€ п≥сл€ нього на число.
// јрифметична операц≥€ 40 + 2 = 42.
// ƒодаткове обТЇднанн€ п≥сл€ чисел надаЇ в≥дпов≥дь 42hillel.
// –езультат: 42hillel

5. '10' - 5 === 6;
// У10Ф стаЇ числом ≥з-за в≥дн≥манн€, а 10 - 5 дор≥внюЇ 5.
// === - це строге пор≥вн€нн€ чисел, 
// якщо значенн€ в≥др≥зн€ютьс€, оператор одразу повертаЇ false.
// –езультат: False

6. true + false
// true перетворюЇтьс€ на 1, а false на 0.
// 1 + 0 = 1.
// –езультат: 1

7. '4px' - 3
// У4pxФ - це NaN ≥з-за частки px.
// NaN неможливо в≥дн€ти в≥д числа, тому в результат≥ NaN стаЇ пр≥ор≥тетом.
// –езультат: Nan

8. '4' - 3
// '4' арифметичне число.
// 4 м≥нус 3 дор≥внюЇ 1.
// –езультат: 1

9. '6' + 3 ** 0;
// ** - це оператор перех≥ду в степ≥нь, завжди маЇ б≥льший приор≥тет.
// Ѕудь €ке число, кр≥м 0 дор≥внюЇ 1.
// У6Ф - це р€док, тому можна провести конкатинац≥ю.
// У6Ф + 1 буде зТЇднано в У61Ф.
// –езультат: У61Ф

10. 12 / '6'
// ќператор / - абсолютно матиматичний, тому д≥њ будуть розрахунков≥. 
// 12 \ 6 = 2
// –езультат: 2

11. '10' + (5 === 6);
// ≤з-за найвищого приор≥тету, початкова д≥€ виконуЇтьс€ у дужках, отримано false ≥з-за в≥дсутност≥ р≥вного.
// ƒал≥ в≥дбуваЇтьс€ конкатинац≥€, в результат≥ У10Ф + false = 10false
// –езультат: 10false

12. null == ''
// «наченн€ null при нестрогому пор≥вн€нн≥ дор≥внюЇ т≥льки null або undefined
// –езультат:  false

13. 3 ** (9 / 3);
// —початку ≥з-за найвищого приор≥тету виконуЇтьс€ обчисленн€ в дужках, воно дор≥внюЇ 3.
// ** - це оператор перех≥ду в степ≥нь, завжди маЇ б≥льший приор≥тет.
// 3 переходить в степ≥нь, що дор≥внюЇ 9.
// ≤ 3 множитьс€ на 9 буде 27.
// –езультат: 27

14. !!'false' == !!'true'
// !! значить двойне запереченн€.
// == значить нестроге пор≥вн€нн€.
// УTrueФ та УfalseФ значать true, бо двоЇ тексти в на€вност≥ та не €вл€ютьс€ булевими.
// –езультат: true

15. 0 || '0' && 1
// || значить або чи OR маЇ нижчий приор≥тет.
// && значить ≤ чи AND маЇ найвижчий пр≥ор≥тет.
// –€док С0Т маЇ значенн€ 1, бо Ї true - на€вн≥сть чогось.
// «араз маЇмо 0 || 1.
// ќператор || шукаЇ перше true значенн€, а ≥з-за на€вност≥ 0 та 1 в≥дпов≥дь буде 1.
// –езультат: 1

16.(+null == false) < 1;
// —початку виконуЇтьс€ д≥€ в дужках.
// ѕлюс перед дужками примусово перетворюЇ значенн€ на число, в данному випадку - це 0.
// 0 == 0 значить true.
// ор≥вн€нн€ true < 1 значить false, бо 1 не менше 1.
// –езультат: false

17. false && true || true
// —початку виконуЇтьс€ д≥€ оператора AND, в≥н маЇ вищий приор≥тет.
// ќтримано false, частина false && true повертаЇ false.
// ќператор || шукаЇ перше true значенн€, отримуЇмо true.
// –езультат: true

18. false && (false || true);
// —початку виконуЇтьс€ вираз у дужках, || повертаЇ true, оск≥льки оператор || шукаЇ першу ≥стину.
// «алишаЇтьс€ вираз false && true.
// ќператор && вимагаЇ ≥стинност≥ обох частин, тому повертаЇ false.
// –езультат: false

19. (+null == false) < 1 ** 5;
// —початку виконуЇтьс€ вираз у дужках. +null = 0, бо + перед null перетворюЇтьс€ на 0 ≥з-за спроби перетворити на число, а false значить 0 в обчисленн€х.
// 1 ** 5 значить, що 1 потр≥бно перевести в степ≥нь - буде 1.
// «наченн€ дор≥внюють true < 1, але true перетворюЇтьс€ на 1.
// 1 < 1 значит false, бо 1 не менше за 1, а дор≥внюЇ њй.
// –езультат: false